{
  "navigation": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "articles": "Articles",
    "videos": "Videos",
    "contact": "Contact",
    "resume": "Resume"
  },
  "common": {
    "getInTouch": "Get in Touch",
    "viewResume": "View Resume",
    "readMore": "Read More",
    "viewProject": "View Project",
    "backToHome": "Back to Home",
    "search": "Search",
    "menu": "Menu"
  },
  "home": {
    "title": "Sophia Chen - Tech Portfolio",
    "heroName": "Sophia Chen",
    "heroSubtitle": "Software Engineer & Content Creator from San Francisco, CA",
    "aboutTitle": "About Me",
    "aboutText": "I'm a software engineer passionate about building innovative solutions and sharing my knowledge with the tech community. I specialize in web development, with a focus on creating user-friendly and efficient applications. In my free time, I enjoy writing articles, creating videos, and exploring new technologies.",
    "featuredProjectsTitle": "Featured Projects",
    "latestArticlesTitle": "Latest Articles",
    "recentVideosTitle": "Recent Videos"
  },
  "projects": {
    "projectAlpha": {
      "title": "Project Alpha",
      "description": "A web application for managing tasks and projects.",
      "category": "Web Application",
      "completedIn": "Completed in 2024",
      "fullDescription": "A comprehensive task and project management web application designed to streamline team collaboration and boost productivity. Built with modern web technologies and featuring an intuitive user interface.",
      "technologies": [
        "React",
        "Node.js",
        "MongoDB",
        "Socket.io"
      ],
      "features": [
        "Real-time collaboration",
        "Task management",
        "Project tracking",
        "Team communication",
        "File sharing",
        "Progress analytics"
      ],
      "technicalImplementation": "The application follows a modern full-stack architecture with a React frontend and Node.js backend. The frontend utilizes React hooks for state management and implements a component-based architecture for maximum reusability and maintainability.",
      "challenges": "One of the main challenges was implementing real-time synchronization across multiple users while maintaining data consistency. We solved this by implementing a robust conflict resolution system and optimistic updates.",
      "results": "The application has been successfully deployed and is being used by over 500 teams worldwide, with a 95% user satisfaction rate and 40% improvement in team productivity metrics."
    },
    "mobileAppBeta": {
      "title": "Mobile App Beta",
      "description": "A mobile app for tracking fitness goals and progress.",
      "category": "Mobile Application",
      "completedIn": "In Development",
      "fullDescription": "A cross-platform mobile application for fitness tracking and goal setting, built with React Native and featuring offline sync capabilities.",
      "technologies": [
        "React Native",
        "Firebase",
        "Redux",
        "AsyncStorage"
      ]
    },
    "dataInsightsDashboard": {
      "title": "Data Insights Dashboard",
      "description": "A dashboard for visualizing key performance indicators.",
      "category": "Data Visualization",
      "completedIn": "Completed in 2023",
      "fullDescription": "An interactive dashboard for visualizing business metrics and KPIs, built with modern data visualization libraries.",
      "technologies": [
        "D3.js",
        "React",
        "Python",
        "PostgreSQL"
      ]
    },
    "relatedProjects": "Related Projects"
  },
  "articles": {
    "reactHooksGuide": {
      "title": "Mastering React Hooks: A Comprehensive Guide",
      "category": "Tech",
      "description": "Learn how to effectively use React Hooks to manage state and side effects in your applications."
    },
    "techInterviewProcess": {
      "title": "Navigating the Tech Interview Process",
      "category": "Career",
      "description": "Tips and strategies for successfully navigating the technical interview process and landing your dream job."
    }
  },
  "videos": {
    "tailwindTutorial": {
      "title": "Building a Responsive Website with Tailwind CSS",
      "category": "Tutorial",
      "description": "A step-by-step tutorial on creating a responsive website using the Tailwind CSS framework."
    },
    "dayInLife": {
      "title": "A Day in the Life of a Software Engineer",
      "category": "Vlog",
      "description": "Follow along as I share a typical day in my life as a software engineer, from coding to meetings and more."
    }
  },
  "about": {
    "title": "About - Sophia Chen",
    "pageTitle": "About Me",
    "myStoryTitle": "My Story",
    "myStoryText1": "My journey into software engineering began during my computer science studies at UC Berkeley, where I discovered my passion for creating digital solutions that make a real impact. What started as curiosity about how websites work evolved into a deep love for full-stack development.",
    "myStoryText2": "Over the past five years, I've had the privilege of working with amazing teams at both startups and established tech companies. I've contributed to products used by millions of users, led development teams, and mentored junior developers.",
    "skillsTitle": "Skills & Expertise",
    "experienceTitle": "Experience",
    "educationTitle": "Education",
    "interestsTitle": "Interests & Hobbies"
  },
  "contact": {
    "title": "Contact - Sophia Chen",
    "pageTitle": "Get in Touch",
    "subtitle": "I'd love to hear from you! Whether you have a project in mind, want to collaborate, or just want to say hello.",
    "formTitle": "Send me a message",
    "nameLabel": "Name",
    "emailLabel": "Email",
    "messageLabel": "Message",
    "sendButton": "Send Message",
    "connectTitle": "Let's Connect",
    "socialDescription": "Follow me on social media for updates on my latest projects and insights."
  },
  "footer": {
    "copyright": "© 2024 Sophia Chen. All Rights Reserved."
  },
  "meta": {
    "homeDescription": "Sophia Chen's tech portfolio showcasing software engineering projects, articles, and videos about web development and modern technologies.",
    "aboutDescription": "Learn more about Sophia Chen, a passionate software engineer specializing in web development, with expertise in React, Node.js, and modern web technologies.",
    "projectsDescription": "Explore my portfolio of software development projects, from web applications to mobile apps and data visualization tools.",
    "articlesDescription": "Read my latest articles about software development, web technologies, and programming best practices.",
    "videosDescription": "Watch my video tutorials and vlogs about software engineering, coding, and tech industry insights.",
    "contactDescription": "Get in touch with Sophia Chen for collaboration opportunities, project inquiries, or just to connect and discuss technology."
  },
  "loading": {
    "text": "Loading...",
    "translating": "Translating page..."
  },
  "errors": {
    "translationFailed": "Failed to load translations",
    "networkError": "Network error occurred",
    "tryAgain": "Please try again"
  },
  "accessibility": {
    "languageSwitcher": "Language switcher",
    "currentLanguage": "Current language: English",
    "switchToZh": "Switch to Chinese",
    "switchToEn": "Switch to English"
  }
}